let dataList = [
  '足少阳胆经 子时（23点至凌晨1点）—胆经旺。子时睡得足，黑眼圈不露；\n' +
    '中医理论认为；“肝之余气，泄于明胆，聚而成精。”人在子时前入眠，胆方能完成代谢。“胆汁有多清，脑就有多清。”' +
    '子时前入睡者，晨醒后头脑清晰、气色红润，没有黑眼圈。反之，常于子时内不能入睡者，则气色青白，眼眶昏黑。同时因胆汁排毒代谢不良更容易生成结晶、结石。\n',

  '肝经 丑时（凌晨1点-3点）是肝经开穴运转排毒的时间，丑时肝经旺。丑时不睡晚，脸上不长斑；\n' +
    '中医理论认为：肝藏血、人卧则血归于肝。如果丑时不能入睡，肝脏还在输出能量支持人的思维和行动，就无法完成新陈代谢。所以丑时前未能入睡者，面色青灰，情志怠慢而躁，易生肝病，脸色晦暗长斑。\n' +
    '虚症：易疲劳、视力减退、性功能减退、头晕眼花、皮肤枯黄等。\n' +
    '实证：肝火旺、脾气不好、头晕腰痛、月经失调、失眠、肋间神经痛等。\n' +
    '饮食多选择：花生、芝麻、核桃仁、山楂、葡萄、香蕉、李子、番茄、莲藕、韭菜、木耳、牛肉、鸡肉、海带等。',

  '肺经 凌晨3点-5点（寅时）是肺经开穴运行的时间。寅时肺经旺，寅时睡得熟，色红精气足。\n' +
    '“肺朝百脉。”肝在丑时把血液推陈出新之后，将新鲜血液提供给肺，通过肺送往全身。所以，人在清晨面色红润，精力充沛。寅时，有肺病者反映最为强烈，如剧咳或哮喘而醒。\n' +
    '虚症：皮肤免疫力下降，天寒手足冰冷、麻痹、咽喉干、咳嗽等。\n' +
    '实证：呼吸不畅、咽喉异常、胸闷、气喘、扁桃炎、咳嗽、肩背酸痛易患痔疮等。\n' +
    '饮食多选择：白菜、梨子、豆腐、豆浆、牛奶。',

  '手阳明大肠经 凌晨5点-7点（卯时）这段时间是手阳明大肠经开穴运行的时间。卯时大肠经旺，卯时大肠蠕，排毒渣滓出；\n' +
    '“肺与大肠相表里。”肺将充足的新鲜血液布满全身，紧接着促进大肠进入兴奋状态，完成吸收食物中的水分和营养、排出渣滓的过程。清晨起床后最好排大便。\n' +
    '虚症：腹痛，腹鸣腹泻、大肠功能减弱、肩膀僵硬、皮肤无光泽、肩酸、喉干、喘息、宿便等。\n' +
    '实症：腹胀、易便秘、易患痔疮、肩背部不适或疼痛、牙疼、皮肤异常、上脘异常等。\n' +
    '饮食多选择：茄子、菠菜、香蕉、蘑菇、木耳、玉米、扁豆、豌豆等。',

  '足阳明胃经 辰时（7点到9点）—胃经旺。辰时吃早餐，营养身体安；\n' +
    '7点-9点这时大部分人都已经起床了，如果你有胃痛、胃酸等毛病，可以建议在这个时间段养养胃哦，因为这段时间是胃经开' +
    '穴运行的时间，在这个时间段来吃些养胃的食物效果是最明显的。例如：凤梨、香瓜、南瓜、番茄、柠檬、柳橙、苹果、红' +
    '茶、茴香、芹菜、木耳、香菜、蘑菇、玉米、牛肉、牛奶、羊奶、扁豆、马铃薯等。起床健身后，饮一杯白开水，用木梳梳发' +
    '百余遍，有醒脑明目的作用。洗脸漱口，早餐。早餐宜食粥，宜淡素，宜饱。\n' +
    '虚症：消化不良、易胃胀气和食欲不振、颜面浮肿、易打嗝、饭后容易胃痛、腹泻或呕吐。\n' +
    '实症：容易饿、胃弱、关节异常、食欲异常、口干、易便秘。',

  '足太阴脾经 已时（9点至11点）—脾经旺。已时脾经旺，造血身体状；\n' +
    '“脾主运化，脾统血。”脾是消化、吸收、排泄的总调度，又是人体血液的统领。“脾开窍于口，其华在唇。”脾的功能好，' +
    '消化吸收好，血液质量好，所以嘴唇是红润的。唇白标志血气不足，唇暗、唇紫标志寒入脾经。\n' +
    '虚症：内分泌失调或分泌不足、胃弱、膝异常、易失眠、疲劳、食欲不振、大便异常、腹胀等。\n' +
    '实症：脾胃不和消化吸收不好、易腹胀气打嗝、头疼、疲倦乏力、膝关节异常、排便异常等。',

  '手少阴心经 午时（11点至13点）—心经旺。午时一小憩，安神养精气；\n' +
    '“心主神明，开窍于舌，其华在面。”心气推动血液运行，养神、养气、养筋。我们饭后都想睡一会，但是由于种种原因克制' +
    '了这种欲望，如果有条件只要稍微的睡10分钟也会对我们的心脏有很大的帮助，也不要担心会发胖因为时间很短，还可以帮助' +
    '肠胃蠕动减少负担。午餐应美食，不是指山珍海味，而是要求食物暖软，不要吃生冷坚硬的食物。只吃八分饱。食后用茶漱' +
    '口，涤去油腻，然后午休。\n' +
    '虚症：胸闷、脸发红、四肢沉重、易疲倦、气血不良、胸痛、心悸亢奋、语言障碍等。\n' +
    '实症：呼吸不畅血液循环不良引起的头痛、口干口苦、掌心发热等。',

  '手太阳小肠经 未时（13点到15点）—小肠经旺。未时分清浊，饮水能降火；\n' +
    '小肠分清浊，把水液归于膀胱，糟粕送入大肠，精华上输于脾。小肠经在未时对人一天的营养进行调整。如小肠有热，人会干' +
    '咳、排屁。此时多喝水、喝茶有利小肠排素降火。',

  '足太阳膀胱经 申时（15点至17点）—膀胱经旺。申时津液足，养阴身体舒；\n' +
    '膀胱贮藏水液和津液，水液排出体外，津液循环在体内。若膀胱有热可致膀胱咳，且咳而遗尿。申时人体温较热，阴虚的人最' +
    '为突出。此时适当的活动有助于体内津液循环，喝滋阴泻火的茶水对阴虚的人最有效。\n' +
    '虚症：背部异常、腰痛、脚神经异常、腿酸、痔疮尿频等。\n' +
    '实症：后颈部疼痛、坐骨神经痛、腰痛、头疼、流泪、流鼻血等。',

  '足少阴肾经 酉时（17点至19点）—肾经旺。酉时肾藏精，纳华元气清；\n' +
    '“肾藏生殖之精和五脏六腑之精。肾为先天之根。”人体经过申时泻火排毒，肾在酉时进入贮藏精华的阶段。此时不适宜太强' +
    '的运动量，也不适宜大量喝水。\n' +
    '虚症：耳鸣、健忘、尿频、腿酸、性欲减退、便秘、元气不足、易疲劳、骨质疏松，天寒手脚冰冷、脚气等。\n' +
    '实症：耳鸣、月经不调、口干舌燥、血压异常、小便量少、色深、浑浊、性欲减退、神经衰弱、足发热发汗、生殖器病变等。',

  '手厥阴心包经 戌时（19点至21点）—心包经旺。戌时护心脏，减压心舒畅；\n' +
    '“心包为心之外膜，附有脉络，气血通行之道。邪不能容，容之心伤。”心包是心的保护组织，又是气血通道。心包经戌时最' +
    '兴旺，可清除心脏周围外邪，使心脏处于完好状态。此时一定要保持心情舒畅：看书听音乐、或做SPA、跳舞、耍太极……放' +
    '松心情，释放压力。' +
    '虚症：大多表现为润滑液分泌不足、心跳异常、气喘、失眠多梦、心悸亢奋、语言障碍、手掌发热等。\n' +
    '实症：心包发炎、胸闷、心痛、上脘异常、喜欢睡、心血管病变、易头昏、头痛等。',

  '手少阳三焦经 亥时（21点到23点）－－三焦经旺。亥时百脉通，养身养娇容。\n' +
    '三焦是六腑中最大的腑，具有主持诸气，疏通水道的作用。亥时三焦能通百脉。人如果在亥时睡眠，百脉可得到最好的休养生' +
    '息，对身体对美容十分有益。百岁老人有个共同特点，即在亥时睡觉。现代人如不想此时睡觉，可听音乐、看书、看电视、练' +
    '瑜伽，但最好不要超过亥时睡觉。' +
    '虚症：免疫力下降、易疲劳、上肢无力、腹部堵胀、体毛变浓、呼吸困难、胃寒等。\n' +
    '实症：淋巴发炎、偏头痛、肩膀酸痛、颈侧酸痛无力、发热、耳鸣、小便异常等。',
];

function _fillzero(s) {
  return s < 10 ? '0' + s : s;
}

export function getData(h = new Date().getHours()) {
  let f = '';
  let desc = '';
  if (h == 23) {
    f = '01';
    desc = dataList[0];
  } else {
    f = _fillzero(parseInt((h + 1) / 2) + 1);
    desc = dataList[parseInt((h + 1) / 2)];
  }

  return [
    require('../img/' + f + '_1.gif'),
    require('../img/' + f + '_2.gif'),
    desc,
  ];
}

export function formatTime(time = 0, format = 'YYYY-MM-DD hh:mm:ss') {
  const now = new Date().getTime();
  if (!time) time = now;
  while (time.toString().length < 13) time += '0';
  const date = new Date(time);
  //date.getMonth()
  /** 参数集 年-月-日 时:分:秒 */
  const arg = {
    year: date.getFullYear(),
    month: _fillzero(date.getMonth() + 1),
    day: _fillzero(date.getDate()),
    hours: _fillzero(date.getHours()),
    minutes: _fillzero(date.getMinutes()),
    seconds: _fillzero(date.getSeconds()),
  };

  /** 判断有没有指定的时间格式 */
  switch (format) {
    case 'YYYY-MM-DD hh:mm:ss':
      return `${arg.year}-${arg.month}-${arg.day} ${arg.hours}:${arg.minutes}:${arg.seconds}`;
    case 'YYYY-MM-DD':
      return `${arg.year}-${arg.month}-${arg.day}`;
    case 'MM-DD':
      return `${arg.month}-${arg.day}`;
    case 'hh:mm:ss':
      return `${arg.hours}:${arg.minutes}:${arg.seconds}`;
    case 'hh:mm':
      return `${arg.hours}:${arg.minutes}`;
    case 'computed': //判断是不是需要进行计算
      if (now > time) {
        const dt = Math.abs(time - now), //时间已过去多少毫秒
          S = dt / 1000, //秒
          M = S / 60, //分
          H = M / 60, //小时
          D = H / 24, //天
          W = D / 7; //周
        /**
					~~ ==>表示取整数部分 类似与 parseInt
				*/
        if (~~W > 0 && W < 3) {
          return ~~W + '周前';
        } else if (D < 7 && ~~D > 0) {
          return ~~D + '天前';
        } else if (~~H > 0 && H < 24) {
          return ~~H + '小时前';
        } else if (~~M > 0 && M < 60) {
          return ~~M + '分钟前';
        } else if (~~S > 0 && S < 60) {
          return ~~S + '秒前';
        }
      } else {
        console.log('未来的时间');
      }
      return `${arg.year}-${arg.month}-${arg.day} ${arg.hours}:${arg.minutes}:${arg.seconds}`;
    default:
      return `${arg.year}-${arg.month}-${arg.day} ${arg.hours}:${arg.minutes}:${arg.seconds}`;
  }
}
